src/DataProcessors/ПечатьСчетНаОплатуКонструктор/ПечатьСчетНаОплатуКонструктор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьСчетНаОплатуКонструктор</name>
</mdclass:DataProcessor>

src/InformationRegisters/НастройкиКонструктораПечати/НастройкиКонструктораПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонструктораПечати</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <resources>
    <name>НастройкиБлоков</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/DataProcessors/ПечатьСчетНаОплатуКонструктор/Forms/НастройкаБлоков/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("МассивОбъектов") И ТипЗнч(Параметры.МассивОбъектов) = Тип("Массив") Тогда
		Для Каждого Ссылка Из Параметры.МассивОбъектов Цикл
			МассивОбъектов.Добавить(Ссылка);
		КонецЦикла;
	КонецЕсли;

	ЗагрузитьНастройкиБлоков();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБлокиПечати

&НаКлиенте
Процедура БлокиПечатиВключенПриИзменении(Элемент)

	ТекущиеДанные = Элементы.БлокиПечати.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Взаимоисключение блоков одной группы
	Если ТекущиеДанные.Включен И ЗначениеЗаполнено(ТекущиеДанные.Группа) Тогда
		Для Каждого СтрокаТаблицы Из БлокиПечати Цикл
			Если СтрокаТаблицы.Идентификатор <> ТекущиеДанные.Идентификатор
				И СтрокаТаблицы.Группа = ТекущиеДанные.Группа Тогда
				СтрокаТаблицы.Включен = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)

	АктивныеБлоки = Новый Массив;
	Для Каждого СтрокаТаблицы Из БлокиПечати Цикл
		Если СтрокаТаблицы.Включен Тогда
			АктивныеБлоки.Добавить(Новый Структура("Идентификатор", СтрокаТаблицы.Идентификатор));
		КонецЕсли;
	КонецЦикла;

	Если АктивныеБлоки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одного блока для печати.'"));
		Возврат;
	КонецЕсли;

	АдресРезультата = СформироватьНаСервере(АктивныеБлоки);
	ТабличныйДокумент = ПолучитьИзВременногоХранилища(АдресРезультата);

	ИдентификаторПФ = "СчетНаОплатуКонструктор";
	Заголовок = НСтр("ru = 'Счёт на оплату (конструктор)'");

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПФ);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПФ);
	ПечатнаяФорма.СинонимМакета          = Заголовок;
	ПечатнаяФорма.ТабличныйДокумент      = ТабличныйДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы  = Заголовок;

	ДополнительныеПараметры = УправлениеПечатьюКлиент.ПараметрыПечати();
	ДополнительныеПараметры.ЗаголовокФормы = Заголовок;

	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, , ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)

	СдвинутьСтроку(-1);

КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)

	СдвинутьСтроку(1);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)

	СохранитьНастройкиНаСервере();
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Настройки сохранены'"),
		,
		НСтр("ru = 'Настройки блоков печати сохранены.'"),
		БиблиотекаКартинок.Информация32);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СдвинутьСтроку(Смещение)

	ИдСтроки = Элементы.БлокиПечати.ТекущаяСтрока;
	Если ИдСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаДанных = БлокиПечати.НайтиПоИдентификатору(ИдСтроки);
	Индекс = БлокиПечати.Индекс(СтрокаДанных);
	НовыйИндекс = Индекс + Смещение;

	Если НовыйИндекс < 0 Или НовыйИндекс >= БлокиПечати.Количество() Тогда
		Возврат;
	КонецЕсли;

	БлокиПечати.Сдвинуть(Индекс, Смещение);
	Элементы.БлокиПечати.ТекущаяСтрока = ИдСтроки;

КонецПроцедуры

// Загружает настройки блоков из регистра или подставляет значения по умолчанию.
&НаСервере
Процедура ЗагрузитьНастройкиБлоков()

	НастройкиПоУмолчанию = Обработки.ПечатьСчетНаОплатуКонструктор.НастройкиБлоковПоУмолчанию();
	СохраненныеНастройки = ПрочитатьСохраненныеНастройки();

	Если СохраненныеНастройки <> Неопределено Тогда
		НастройкиБлоков = ОбъединитьНастройки(НастройкиПоУмолчанию, СохраненныеНастройки);
	Иначе
		НастройкиБлоков = НастройкиПоУмолчанию;
	КонецЕсли;

	БлокиПечати.Очистить();
	Для Каждого ОписаниеБлока Из НастройкиБлоков Цикл
		НоваяСтрока = БлокиПечати.Добавить();
		НоваяСтрока.Идентификатор = ОписаниеБлока.Идентификатор;
		НоваяСтрока.Представление = ОписаниеБлока.Представление;
		НоваяСтрока.Включен       = ОписаниеБлока.Включен;
		НоваяСтрока.Группа        = ОписаниеБлока.Группа;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПрочитатьСохраненныеНастройки()

	МенеджерЗаписи = РегистрыСведений.НастройкиКонструктораПечати.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь     = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ИмяПечатнойФормы = "СчетНаОплатуКонструктор";
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Хранилище = МенеджерЗаписи.НастройкиБлоков;
	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Хранилище.Получить();
	Если ТипЗнч(Результат) <> Тип("Массив") Или Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Объединяет сохранённые настройки с текущими значениями по умолчанию.
// Сохранённый порядок и флаги применяются к актуальному списку блоков;
// новые блоки (добавленные после сохранения) попадают в конец.
&НаСервере
Функция ОбъединитьНастройки(НастройкиПоУмолчанию, СохраненныеНастройки)

	БлокиПоИд = Новый Соответствие;
	Для Каждого Блок Из НастройкиПоУмолчанию Цикл
		БлокиПоИд.Вставить(Блок.Идентификатор, Блок);
	КонецЦикла;

	Результат = Новый Массив;
	Обработанные = Новый Соответствие;

	Для Каждого СохраненныйБлок Из СохраненныеНастройки Цикл
		БлокПоУмолчанию = БлокиПоИд[СохраненныйБлок.Идентификатор];
		Если БлокПоУмолчанию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		БлокПоУмолчанию.Включен = СохраненныйБлок.Включен;
		Результат.Добавить(БлокПоУмолчанию);
		Обработанные.Вставить(СохраненныйБлок.Идентификатор, Истина);
	КонецЦикла;

	Для Каждого Блок Из НастройкиПоУмолчанию Цикл
		Если Обработанные[Блок.Идентификатор] = Неопределено Тогда
			Результат.Добавить(Блок);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	МассивНастроек = Новый Массив;
	Для Каждого СтрокаТаблицы Из БлокиПечати Цикл
		МассивНастроек.Добавить(Новый Структура("Идентификатор, Включен",
			СтрокаТаблицы.Идентификатор,
			СтрокаТаблицы.Включен));
	КонецЦикла;

	МенеджерЗаписи = РегистрыСведений.НастройкиКонструктораПечати.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь     = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ИмяПечатнойФормы = "СчетНаОплатуКонструктор";
	МенеджерЗаписи.НастройкиБлоков  = Новый ХранилищеЗначения(МассивНастроек);
	МенеджерЗаписи.Записать();

КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(АктивныеБлоки)

	МассивДокументов = Новый Массив;
	Для Каждого ЭлементСписка Из МассивОбъектов Цикл
		МассивДокументов.Добавить(ЭлементСписка.Значение);
	КонецЦикла;

	ТабличныйДокумент = Обработки.ПечатьСчетНаОплатуКонструктор.СформироватьТабличныйДокументПоБлокам(
		МассивДокументов, АктивныеБлоки);

	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтаФорма.УникальныйИдентификатор);

КонецФункции

#КонецОбласти
